[
  {
    "url": "https://collection.bccampus.ca/textbooks/university-success/",
    "subjects": [
      "Academic/Career Success"
    ],
    "title": "University Success",
    "author": "N. Mahoney, B. Klassen, M. D'Eon",
    "description": "University Success has a student-friendly format arranged to help you develop the essential skills and provide the information you need to succeed in university. This is not a textbook full of theory and extensive detail that merely discusses student success; rather, this is a how-to manual for your first year of study. The book provides realistic, practical guidance ranging from study skills to personal health, from test taking to managing time and money. Furthermore, University Success is accessible—information is presented concisely and as simply as possible.University Success has the following features to help you achieve your goals: Each chapter asks you to evaluate yourself because success starts with recognizing your strengths and weaknesses, your hopes and desires, and your own personal, individual realities. You’ll develop your own goals based on these self-assessments, determining what success in college really means for you as an individual. Throughout the book, you will find numerous interactive activities created to help you improve your skills. To assist you with this, the material is presented in easily digestible “chunks” of information so you can begin applying it immediately in your own life—and get the most out of your university education."
  },
  {
    "url": "https://collection.bccampus.ca/textbooks/essential-skills-companion-kit-for-culinary-arts-trades-training-bccampus-116/",
    "subjects": [
      "Trades"
    ],
    "title": "Essential Skills Companion Kit for Culinary Arts Trades Training",
    "author": "Marlin Ratch, Francesca de Bastiani, Shelby Desjarlais, Andrew George, Nathan Hyam, Christ Monkman, Jason Forseth",
    "description": "The Essential Skills Companion Kit to Culinary Arts Trades Training was developed to complement technical Culinary Arts Trades Training. The various activity sets are designed to reinforce academic information that students are required to know during their training. The Content Experts provided the Curriculum Development Team with themes and the curriculum was created to practice Essential Skills such as Reading Text, Document Use, Thinking Skills, Oral Communication and Working with Others."
  },
  {
    "url": "https://collection.bccampus.ca/textbooks/cross-connection-control-for-plumbing-and-piping-trades-plumber-apprenticeship-program-level-3-bccampus-93/",
    "subjects": [
      "Trades"
    ],
    "title": "Cross Connection Control for Plumbing and Piping Trades",
    "author": "Richard V. Mawle",
    "description": "When you have completed these Learning Tasks, you should be able describe the following:Demonstrate knowledge of cross connection control devices, their applications, and operation.Demonstrate knowledge of the procedures used to install, maintain, repair, test, and troubleshoot cross connection control devices."
  },
  {
    "url": "https://collection.bccampus.ca/textbooks/basic-motor-control-bccampus-35/",
    "subjects": [
      "Trades"
    ],
    "title": "Basic Motor Control",
    "author": "Aaron Lee (British Columbia Institute of Technology) and Chad Flinn",
    "description": "This readily accessible online resource was developed for anyone who has interest in, or works with, AC motors and their associated motor control equipment. Whether you are an electrical apprentice learning about the subject in school or a seasoned journeyperson installing equipment in the field, you will find it easy to navigate through the descriptive text, original diagrams, and explanatory videos to find the exact information you are looking for."
  },
  {
    "url": "https://collection.bccampus.ca/textbooks/basic-kitchen-and-food-service-management-bccampus-34/",
    "subjects": [
      "Trades"
    ],
    "title": "Basic Kitchen and Food Service Management",
    "author": "BC Cook Articulation Committee",
    "description": "Basic Kitchen and Food Service Management is one of a series of Culinary Arts open textbooks developed to support the training of students and apprentices in British Columbia’s foodservice and hospitality industry. Although created with the Professional Cook, Baker, and Meatcutter programs in mind, these have been designed as a modular series, and therefore can be used to support a wide variety of programs that offer training in foodservice skills.Other books in the series include:Basic Kitchen and Food Service ManagementWorking in the Food Service IndustryWorkplace Safety in the Food Service IndustryMeat Cutting and ProcessingHuman Resources in the Food Service and Hospitality IndustryNutrition and Labelling for the Canadian BakerUnderstanding Ingredients for the Canadian BakerModern Pastry and Plated Dessert Techniques"
  },
  {
    "url": "https://collection.bccampus.ca/textbooks/basic-hvac-bccampus-33/",
    "subjects": [
      "Trades"
    ],
    "title": "Basic HVAC",
    "author": "Aaron Lee (British Columbia Institute of Technology)",
    "description": "This readily accessible online introductory resource was developed for anyone who has interest in, or works with, HVAC controls and equipment. Designed for electrical and HVAC apprentices learning about the subject in school, you will find the descriptive text and original diagrams easy to navigate through, while the question bank will help students review the subject matter covered in each section."
  },
  {
    "url": "https://collection.bccampus.ca/textbooks/barbering-techniques-for-hairstylists-bccampus-30/",
    "subjects": [
      "Trades"
    ],
    "title": "Barbering Techniques for Hairstylists",
    "author": "Arden Magtiza and Gary Franceschini",
    "description": "This manual serves as a guide for apprentices who desire to grow beyond their foundational haircutting knowledge and skills, and expand their knowledge to include more advanced barbering services, such as beard and moustache design, and straight razor shaves."
  },
  {
    "url": "https://collection.bccampus.ca/textbooks/university-101/",
    "subjects": [
      "Academic/Career Success"
    ],
    "title": "University 101",
    "author": "Kwantlen Polytechnic University",
    "description": "University 101: Study, Strategize, and Succeed helps students to create a foundation for post-secondary studies by learning how to learn. By taking the time to read this book and work through the exercises included, students are investing in the skills that will support them in all of their classes and future learning. Successful students share a set of skills and habits in common. The good news is that these skills are not a secret; anyone can learn the skills that support successful learning. By taking some time to learn proven study strategies, students will be able to reach their learning goals, and avoid the pitfalls that can take them off-track."
  },
  {
    "url": "https://collection.bccampus.ca/textbooks/student-success/",
    "subjects": [
      "Academic/Career Success"
    ],
    "title": "Student Success",
    "author": "Mary Shier",
    "description": "This book offers study skills and practices for college and university students to help them make a positive transition to post-secondary education, learn how to be a successful student, and make the most of their learning experience. This textbook was created to provide a resource for the ABE provincial level course, Student Success, and it provides resources to meet all the required and optional learning outcomes. The course can be used an elective course towards the BC Adult Graduation Diploma. Students don’t need to be taking a Student Success course to benefit from this text. Post-secondary students can use this material to help them become better, more successful students. Faculty can use any parts of it to give to their students in any of their courses as applicable. Others (anyone) can use applicable life skills chapters. The book is written so each chapter stands on its own as an independent topic and doesn’t require knowledge of previous chapters, so students and instructors can use only the sections they need."
  },
  {
    "url": "https://collection.bccampus.ca/textbooks/strategies-for-academic-success/",
    "subjects": [
      "Academic/Career Success"
    ],
    "title": "Strategies for Academic Success",
    "author": "Liv Marken",
    "description": "Strategies for Academic Success accompanies the first-year University of Saskatchewan College of Arts and Science online course by the same name. However, the information it contains will apply to post-secondary institutions all over. The textbook has a reader-friendly format arranged to help you develop the essential skills and provide the information you need to succeed in university."
  },
  {
    "url": "https://collection.bccampus.ca/textbooks/learning-to-learn-online-kwantlen-polytechnic-university-208/",
    "subjects": [
      "Academic/Career Success"
    ],
    "title": "Learning to Learn Online",
    "author": "Kwantlen Polytechnic University, Christina Page, Adam Vincent",
    "description": "Learning to Learn Online helps you prepare for online learning success by introducing you to the online learning environment and your role as a learner within it. As you come to understand yourself as an self-directed learner, you will also be introduced to effective learning strategies: time management for online learners, information management, professional communication, and reading strategies.Welcome to your online learning journey!"
  },
  {
    "url": "https://collection.bccampus.ca/textbooks/blueprint-for-success-in-college-and-career-rebus-community-50/",
    "subjects": [
      "Academic/Career Success"
    ],
    "title": "Blueprint for Success in College and Career",
    "author": "Dave Dillon",
    "description": "Blueprint for Success in College and Career is a students’ guide for classroom and career success. This text, designed to show how to be successful in college and in career preparation, focuses on :study skillstime managementcareer explorationhealthfinancial literacyThis book is a remix of four previously existing OER (Open Educational Resources):A Different Road To College: A Guide For Transitioning To College For Non-traditional Students by Alise LamoreauxHow to Learn Like a Pro! by Phyllis NissilaFoundations of Academic Success: Words of Wisdom, edited by Thomas PriesterCollege Success, provided by Lumen Learningand one previously copyrighted textbook with content that is now openly licensed: Blueprint for Success in College: Indispensable Study Skills and Time Management Strategies by Dave Dillon."
  },
  {
    "url": "https://collection.bccampus.ca/textbooks/global-womens-issues-extended-version/",
    "subjects": [
      "Social Sciences"
    ],
    "title": "Global Women's Issues",
    "author": "United States Department of State Bureau of International Information Programs",
    "description": "We cannot solve global challenges unless women participate fully in efforts to find solutions. Female participation in the private sector is a crucial economic driver for societies worldwide. Economic security benefits every facet of a woman’s life, with positive effects on the health, education and vitality of families. Learn about women who are changing their societies for the better.This book is based on the twelve critical areas of concern identified in the Beijing Declaration and Platform for Action at the Fourth World Conference on Women in Beijing in 1995:The burden of poverty on womenunequal access to education and traininginequalities and inadequacies in and unequal access to health care and related servicesviolence against womenthe effects of armed or other kinds of conflict on womenincluding those living underforeign occupationinequality in economic structures and policiesinequality between men and women in the sharing of power and decision-making at all levelsinsufficient mechanisms at all levels to promote the advancement of womenlack of respect for and inadequate promotion and protection of the human rights of womenstereotyping of women and inequality in women’s access to and participation in all communication systemsespecially in the mediagender inequalities in the management of natural resources and in the safeguarding of the environmentpersistent discrimination against and violation of the rights of the girl childThis extended version of Global Women’s Issues: Women in the World Today includes, for each chaptera summarykey wordsmultiple choice questionsdiscussion questionsessay questionsa list of additional resourcesCopies of the original book are also available in Arabic, Portuguese, and Spanish."
  },
  {
    "url": "https://collection.bccampus.ca/textbooks/adult-literacy-fundamental-mathematics-book-4-bccampus-17/",
    "subjects": [
      "Mathematics"
    ],
    "title": "Adult Literacy Fundamental Mathematics",
    "author": "Liz Girard and Wendy Tagami",
    "description": "This is book four in a six-book series on fundamental mathematics for adult learners. These books include glossaries, self tests, practice requests, grades records, and unit tests. The book also includes an Instructor's Manual."
  },
  {
    "url": "https://collection.bccampus.ca/textbooks/adult-literacy-fundamental-mathematics-book-3-bccampus-16/",
    "subjects": [
      "Mathematics"
    ],
    "title": "Adult Literacy Fundamental Mathematics",
    "author": "Liz Girard and Wendy Tagami",
    "description": "This is book three in a six-book series on fundamental mathematics for adult learners. These books include glossaries, self tests, practice requests, grades records, and unit tests. This book also includes an Instructor's Manual."
  },
  {
    "url": "https://collection.bccampus.ca/textbooks/adult-literacy-fundamental-mathematics-book-2-bccampus-15/",
    "subjects": [
      "Mathematics"
    ],
    "title": "Adult Literacy Fundamental Mathematics",
    "author": "Liz Girard and Wendy Tagami",
    "description": "This is book two in a six-book series on fundamental mathematics for adult learners. These books include glossaries, self tests, practice requests, grades records, and unit tests. The book also includes an Instructor's Manual."
  },
  {
    "url": "https://collection.bccampus.ca/textbooks/adult-literacy-fundamental-mathematics-book-1-2nd-edition-bccampus-14/",
    "subjects": [
      "Mathematics"
    ],
    "title": "Adult Literacy Fundamental Mathematics",
    "author": "Liz Girard and Wendy Tagami",
    "description": "This is book one in a six-book series on fundamental mathematics for adult learners. These books include glossaries, self tests, practice requests, grades records, and unit tests. The book also comes with an Instructor's Manual.Topics in this book include:number and number operationspatternsfunctions and relationsreal life applicationsgeometrytimeThese books align with the learning outcomes for Adult Fundamental Math as outlined in the BC ABE Articulation Handbook."
  },
  {
    "url": "https://collection.bccampus.ca/textbooks/active-calculus-multivariable-2017-edition-grand-valley-state-university-libraries-11/",
    "subjects": [
      "Mathematics"
    ],
    "title": "Active Calculus",
    "author": "Steve Schlicker, David Austin, Matt Boelkins",
    "description": "In Active Calculus Multivariable, we endeavor to actively engage students in learning the subject through an activity-driven approach in which the vast majority of the examples are completed by students. Where many texts present a general theory of calculus followed by substantial collections of worked examples, we instead pose problems or situations, consider possibilities, and then ask students to investigate and explore.Following key activities or examples, the presentation normally includes some overall perspective and a brief synopsis of general trends or properties, followed by formal statements of rules or theorems. While we often offer plausibility arguments for such results, rarely do we include formal proofs.It is not the intent of this text for the instructor or author to demonstrate to students that the ideas of calculus are coherent and true, but rather for students to encounter these ideas in a supportive, leading manner that enables them to begin to understand for themselves why calculus is both coherent and true."
  },
  {
    "url": "https://collection.bccampus.ca/textbooks/active-calculus-2017-edition-grand-valley-state-university-libraries-10/",
    "subjects": [
      "Mathematics"
    ],
    "title": "Active Calculus",
    "author": "Matt Boelkins, David Austin, Steve Schlicker",
    "description": "Active Calculus (2017 edition) may be used as a stand-alone textbook for a standard first semester college calculus course or as a supplement to a more traditional text.Chapters 1–4 address the typical topics for differential calculus, while Chapters 5–8 provide the standard topics of integral calculus, including a chapter on differential equations (Chapter 7) and on infinite series (Chapter 8).In Active Calculus, we endeavor to actively engage students in learning the subject through an activity-driven approach in which the vast majority of the examples are completed by students. We pose problems or situations, consider possibilities, and then ask students to investigate and explore.It is not the intent of this text for the instructor or author to demonstrate to students that the ideas of calculus are coherent and true, but rather for students to encounter these ideas in a supportive, leading manner that enables them to begin to understand for themselves why calculus is both coherent and true."
  },
  {
    "url": "https://collection.bccampus.ca/textbooks/democracy-in-brief-gpa-publications-98/",
    "subjects": [
      "Social Sciences"
    ],
    "title": "Democracy in Brief",
    "author": "United States Department of State Bureau of International Information Programs",
    "description": "Democracy in Brief touches on topics such as rights and responsibilities of citizens, free and fair elections, the rule of law, the role of a written constitution, separation of powers, a free media, the role of parties and interest groups, military-civilian relations and democratic culture."
  },
  {
    "url": "https://collection.bccampus.ca/textbooks/echo-ethnographic-cultural-and-historical-overview-of-yukons-first-peoples-institute-for-community-engaged-research-press-103/",
    "subjects": [
      "Social Sciences"
    ],
    "title": "ECHO",
    "author": "Victoria Elena Castillo, Christine Schreyer, Tosh Southwick",
    "description": "Today, First Nations peoples living in Yukon, Canada are reviving and practicing their cultural traditions in exciting ways. At the same time, there has been an influx of newcomers to the territory who want to learn more about Yukon's Indigenous peoples and their cultures. With hundreds of references for those wanting to delve deeper into particular topics, ECHO is a handbook that provides the most current research pertaining to Yukon First Nations peoples.Topics include:archaeologyethnologylifewaysrelationships with newcomers (in the past and currently)the artsmodern-day land claims.The volume also includes interviews with research collaborators who discuss the importance of community-based research. Castillo, Schreyer, and Southwick's solidly researched handbook serves as an important tool, both for teachers and students, seeking accurate information pertaining to the Indigenous cultures of Yukon."
  },
  {
    "url": "https://collection.bccampus.ca/textbooks/discover-psychology-20-a-brief-introductory-text-noba-102/",
    "subjects": [
      "Social Sciences"
    ],
    "title": "Discover Psychology 2.0",
    "author": "Edward Diener and Robert Biswas-Diener",
    "description": "This textbook presents core concepts common to introductory courses. The 15 units cover the traditional areas of intro-to-psychology; ranging from biological aspects of psychology to psychological disorders to social psychology."
  },
  {
    "url": "https://collection.bccampus.ca/textbooks/american-government-3e-openstax-23/",
    "subjects": [
      "Social Sciences"
    ],
    "title": "American Government",
    "author": "Glen Krutz and Sylvie Waskiewicz",
    "description": "American Government 3e aligns with the topics and objectives of many government courses. The authors have endeavored to make government workings, issues, debates, and impacts meaningful and memorable to students while maintaining the conceptual coverage and rigor inherent in the subject. With this objective in mind, the content of this textbook has been developed and arranged to provide a logical progression from the fundamental principles of institutional design at the founding, to avenues of political participation, to thorough coverage of the political structures that constitute American government.The book builds upon what students have already learned and emphasizes connections between topics as well as between theory and applications. The goal of each section is to enable students not just to recognize concepts, but to work with them in ways that will be useful in later courses, future careers, and as engaged citizens."
  },
  {
    "url": "https://collection.bccampus.ca/textbooks/principles-of-sociological-inquiry-qualitative-and-quantitative-methods-1/",
    "subjects": [
      "Social Sciences"
    ],
    "title": "Principles of Sociological Inquiry",
    "author": "Amy Blackstone",
    "description": "Principles of Sociological Inquiry: Qualitative and Quantitative Methods emphasizes the relevance of research methods for the everyday lives of its readers, undergraduate students. Each chapter describes how research methodology is useful for students in the multiple roles they fill:As consumers of popular and public information,As citizens in a society where findings from social research shape laws, policies, and public life, andAs current and future employees. Connections to these roles are made throughout and directly within the main text of the book.Principles of Sociological Inquiry: Qualitative and Quantitative Methods also provides balanced coverage of qualitative and quantitative approaches by integrating a variety of examples from recent and classic sociological research. The text challenges students to debate and discuss the strengths and weaknesses of both approaches."
  },
  {
    "url": "https://collection.bccampus.ca/textbooks/communications-in-law-enforcement-and-the-criminal-justice-system-key-principles-justice-institute-of-british-columbia-381/",
    "subjects": [
      "Law and Criminal Justice"
    ],
    "title": "Communications in Law Enforcement and the Criminal Justice System",
    "author": "Steve McCartney and Cindy Patterson (Justice Institute of British Columbia)",
    "description": "This book will examine the key principles of communication personnel in law enforcement require. Areas covered include listening skills, communicating tactics, interviewing skills, note-taking, report writing and testifying in court. Also covered is a section on PTSD and its interaction with law enforcement."
  },
  {
    "url": "https://collection.bccampus.ca/textbooks/bc-reads-adult-literacy-fundamental-english-course-pack-6-bccampus-41/",
    "subjects": [
      "Language Learning"
    ],
    "title": "BC Reads: Adult Literacy Fundamental English",
    "author": "Shantel Ivits",
    "description": "This course pack is designed to meet the learning outcomes for Adult Literacy Fundamental English Level 6 (roughly equivalent to grades 7.5 to 9 in the K-12 system). Every chapter includes a level-appropriate, high-interest reading of between 500 and 1,000 words. The readings are freely available in a separate reader with convenient links to the readings in each chapter of this course pack. Font size and line spacing can be adjusted in the online view, and have been enhanced for the print and PDF versions for easier reading. This course pack has been reviewed by subject experts from colleges and universities."
  },
  {
    "url": "https://collection.bccampus.ca/textbooks/bc-reads-adult-literacy-fundamental-english-course-pack-5-bccampus-40/",
    "subjects": [
      "Language Learning"
    ],
    "title": "BC Reads: Adult Literacy Fundamental English",
    "author": "Shantel Ivits",
    "description": "This course pack is designed to meet the learning outcomes for Adult Literacy Fundamental English Level 5 (roughly equivalent to grades 6 to 7.5 in the K-12 system). Every chapter includes a level-appropriate, high-interest reading of between 500 and 800 words. The readings are freely available in a separate reader with convenient links to the readings in each chapter of this course pack. Font size and line spacing can be adjusted in the online view, and have been enhanced for the print and PDF versions for easier reading. This course pack has been reviewed by subject experts from colleges and universities."
  },
  {
    "url": "https://collection.bccampus.ca/textbooks/bc-reads-adult-literacy-fundamental-english-course-pack-4-bccampus-39/",
    "subjects": [
      "Language Learning"
    ],
    "title": "BC Reads: Adult Literacy Fundamental English",
    "author": "Shantel Ivits",
    "description": "This course pack is designed to meet the learning outcomes for Adult Literacy Fundamental English Level 4 (roughly equivalent to grades 4.5 to 6 in the K-12 system). Every chapter includes a level-appropriate, high-interest reading of between 400 and 500 words. The readings are freely available in a separate reader with convenient links to the readings in each chapter of this course pack. Font size and line spacing can be adjusted in the online view, and have been enhanced for the print and PDF versions for easier reading. This course pack has been reviewed by subject experts from colleges and universities."
  },
  {
    "url": "https://collection.bccampus.ca/textbooks/bc-reads-adult-literacy-fundamental-english-course-pack-3-bccampus-38/",
    "subjects": [
      "Language Learning"
    ],
    "title": "BC Reads: Adult Literacy Fundamental English",
    "author": "Shantel Ivits",
    "description": "This course pack is designed to meet the learning outcomes for Adult Literacy Fundamental English Level 3 (roughly equivalent to grades 3 to 4.5 in the K-12 system). Every chapter within the three units includes a level-appropriate, high-interest reading of between 350 and 500 words. The readings are freely available in a separate reader with convenient links to the readings in each chapter of this course pack. For students using this program in a self-paced format, there are audio clips embedded throughout the course pack. These clips narrate the denser sections of text. Font size and line spacing can be adjusted in the online view, and have been enhanced for the print and PDF versions for easier reading. This course pack has been reviewed by subject experts from colleges and universities."
  },
  {
    "url": "https://collection.bccampus.ca/textbooks/bc-reads-adult-literacy-fundamental-english-course-pack-2-bccampus-37/",
    "subjects": [
      "Language Learning"
    ],
    "title": "BC Reads: Adult Literacy Fundamental English",
    "author": "Shantel Ivits",
    "description": "This course pack is designed to meet the learning outcomes for Adult Literacy Fundamental English Level 2 (roughly equivalent to grades 1.5 to 3 in the K-12 system). Every of the eight chapters includes a level-appropriate, high-interest reading of approximately 200 words. The readings are freely available in a separate reader with convenient links to the readings in each chapter of this course pack. The online version of this course pack also contains audio recordings of each story in the reader. These recordings, combined with vocabulary and word pattern exercises, prepare the Level 2 student to read each chapter with greater independence. Font size and line spacing can be adjusted in the online view, and have been enhanced for the print and PDF versions for easier reading. This course pack has been reviewed by subject experts from colleges and universities."
  },
  {
    "url": "https://collection.bccampus.ca/textbooks/bc-reads-adult-literacy-fundamental-english-course-pack-1-bccampus-36/",
    "subjects": [
      "Language Learning"
    ],
    "title": "BC Reads: Adult Literacy Fundamental English",
    "author": "Shantel Ivits",
    "description": "This course pack is designed to meet the learning outcomes for Adult Literacy Fundamental English Level 1 (roughly equivalent to beginner to grade 1.5 in the K-12 system). Each of the nine chapters includes a level-appropriate, high-interest reading of approximately 100 words. The readings are freely available in a separate reader with convenient links to the readings in each chapter of this course pack. The online version of this course pack also contains audio recordings of each story in the reader. These recordings, combined with vocabulary and word pattern exercises, prepare the Level 1 student to read each paragraph-long text with greater independence. Font size and line spacing can be adjusted in the online view, and have been enhanced for the print and PDF versions for easier reading. This course pack has been reviewed by subject experts from colleges and universities."
  },
  {
    "url": "https://collection.bccampus.ca/textbooks/introduction-to-criminal-investigation-processes-practices-and-thinking-justice-institute-of-british-columbia-175/",
    "subjects": [
      "Law and Criminal Justice"
    ],
    "title": "Introduction to Criminal Investigation",
    "author": "Rod Gehl and Darryl Plecas",
    "description": "Introduction to Criminal Investigation, Processes, Practices, and Thinking, as the title suggests, is a teaching text describing and segmenting criminal investigations into its component parts to illustrate the craft of criminal investigation. Delineating criminal investigation within the components of task-skills and thinking-skills, this book describes task-skills such incident response, crime scene management, evidence management, witness management, and forensic analysis, as essential foundations supporting the critical thinking-skills of offence validation and theory development for the creation of effective investigative plans aimed at forming reasonable grounds for belief. The goal of the text is to assist the reader in forming their own structured mental map of investigative thinking practices."
  },
  {
    "url": "https://collection.bccampus.ca/textbooks/global-corruption-4th-edition/",
    "subjects": [
      "Law and Criminal Justice"
    ],
    "title": "Global Corruption",
    "author": "Gerry Ferguson",
    "description": "This book has been specifically created to make it easier for professors to offer a law school course on global corruption. It is also designed as a resource tool for all persons working in the anti-corruption field. The first chapter sets out the general context of global corruption: its nature and extent, and some views on its historical, social, economic and political dimensions. Each subsequent chapter sets out international standards and requirements in respect to combatting corruption — mainly in the UN Convention Against Corruption (UNCAC) and the OECD Bribery of Foreign Officials Convention (OECD Convention).The laws of the United States and United Kingdom are then set out as examples of how those Convention standards and requirements are met in two influential jurisdictions. Finally, the law of Canada is set out. Thus, a professor from Africa, Australia, New Zealand or English-speaking countries in Asia and Europe has a nearly complete coursebook — for example, that professor can delete the Canadian sections of this book and insert the law and practices of his or her home country in their place.While primarily directed to a law school course on global corruption, this book will be of interest and use to professors teaching courses on corruption from other academic disciplines and to lawyers and other anti-corruption practitioners."
  },
  {
    "url": "https://collection.bccampus.ca/textbooks/ethics-in-law-enforcement-bccampus-119/",
    "subjects": [
      "Law and Criminal Justice"
    ],
    "title": "Ethics in Law Enforcement",
    "author": "Steve McCartney and Rick Parent",
    "description": "In this book, you will examine the moral and ethical issues that exist within law enforcement. This book will also familiarize you with the basic history, principles, and theories of ethics. These concepts will then be applied to the major components of the criminal justice system: policing, the courts, and corrections. Discussion will focus on personal values, individual responsibility, decision making, discretion, and the structure of accountability. Specific topics covered will include core values, codes of conduct, ethical dilemmas, organizational consequences, liability, and the importance of critical thinking. By the end of this book, you will be able to distinguish and critically debate contemporary ethical issues in law enforcement."
  },
  {
    "url": "https://collection.bccampus.ca/textbooks/english-literature-victorians-and-moderns-bccampus-112/",
    "subjects": [
      "Humanities"
    ],
    "title": "English Literature",
    "author": "James Sexton",
    "description": "English Literature: Victorians and Moderns is an anthology with a difference. In addition to providing annotated teaching editions of many of the most frequently-taught classics of Victorian and Modern poetry, fiction and drama, it also provides a series of guided research casebooks which make available numerous published essays from open access books and journals, as well as several reprinted critical essays from established learned journals such as English Studies in Canada and the Aldous Huxley Annual with the permission of the authors and editors.Designed to supplement the annotated complete texts of three famous short novels: Henry James’s The Turn of the Screw, Joseph Conrad’s Heart of Darkness, and Aldous Huxley’s Brave New World, each casebook offers cross-disciplinary guided research topics which will encourage majors in fields other than English to undertake topics in diverse areas, including History, Economics, Anthropology, Political Science, Biology, and Psychology. Selections have also been included to encourage topical, thematic, and generic cross-referencing. Students will also be exposed to a wide-range of approaches, including new-critical, psychoanalytic, historical, and feminist."
  },
  {
    "url": "https://collection.bccampus.ca/textbooks/introduction-to-tourism-and-hospitality-in-bc-2nd-edition-bccampus-193/",
    "subjects": [
      "Hospitality/Tourism"
    ],
    "title": "Introduction to Tourism and Hospitality in BC",
    "author": "Morgan Westcott and Wendy Anderson",
    "description": "This textbook is an introduction to the tourism and hospitality industry in British Columbia, and is written with a first year college and university audience in mind. It is a collaborative work with input from educators, industry leaders, employers, and past graduates of BC’s tourism and hospitality management programs.All chapters have been reviewed by experts in the field. Each chapter is organized thematically moving from a global, then national, and finally provincial context. Chapters contain \"Spotlight On\" boxes that highlight an organization, business, or other key component and \"Take a Closer Look\" features that encourage further reading on particular subjects. Key terms, exercises and case studies can be found at the end of each chapter."
  },
  {
    "url": "https://collection.bccampus.ca/textbooks/a-concise-introduction-to-logic-open-suny-textbooks-4/",
    "subjects": [
      "Humanities"
    ],
    "title": "A Concise Introduction to Logic",
    "author": "Craig DeLancey",
    "description": "A Concise Introduction to Logic is an introduction to formal logic suitable for undergraduates taking a general education course in logic or critical thinking and is accessible and useful to any interested in gaining a basic understanding of logic.This text takes the unique approach of teaching logic through intellectual history; the author uses examples from important and celebrated arguments in philosophy to illustrate logical principles. The text also includes a basic introduction to findings of advanced logic.As indicators of where the student could go next with logic, the book closes with an overview of advanced topics, such as the axiomatic method, set theory, Peano arithmetic, and modal logic. Throughout, the text uses brief, concise chapters that readers will find easy to read and to review."
  },
  {
    "url": "https://collection.bccampus.ca/textbooks/antologia-abierta-de-literatura-hispana-rebus-community-28/",
    "subjects": [
      "Humanities"
    ],
    "title": "Antología Abierta de Literatura Hispana",
    "author": "Julie Ann Ward",
    "description": "Una antología crítica de textos literarios del mundo hispanohablante. Se enfoca en autores canónicos y también se intenta incluir voces marginadas. Cada texto tiene una introducción y anotaciones creadas por estudiantes.A critical anthology of literary texts from the Spanish-speaking world. A focus on canonical authors and an attempt to include voices that have been marginalized. Each text includes an introduction and annotations created by students."
  },
  {
    "url": "https://collection.bccampus.ca/textbooks/analyzing-meaning-an-introduction-to-semantics-and-pragmatics-language-science-press-26/",
    "subjects": [
      "Humanities"
    ],
    "title": "Analyzing Meaning",
    "author": "Paul R. Kroeger",
    "description": "This book provides an introduction to the study of meaning in human language, from a linguistic perspective. It covers a fairly broad range of topics, including lexical semantics, compositional semantics, and pragmatics. The chapters are organized into six units:Foundational conceptsWord meaningsImplicature (including indirect speech acts)Compositional semanticsModals, conditionals, and causationTense & aspectMost of the chapters include exercises which can be used for class discussion and/or homework assignments, and each chapter contains references for additional reading on the topics covered.As the title indicates, this book is truly an INTRODUCTION: it provides a solid foundation which will prepare students to take more advanced and specialized courses in semantics and/or pragmatics. It is also intended as a reference for fieldworkers doing primary research on under-documented languages, to help them write grammatical descriptions that deal carefully and clearly with semantic issues. The approach adopted here is largely descriptive and non-formal (or, in some places, semi-formal), although some basic logical notation is introduced. The book is written at a level which should be appropriate for advanced undergraduate or beginning graduate students. It presupposes some previous coursework in linguistics, but does not presuppose any background in formal logic or set theory."
  },
  {
    "url": "https://collection.bccampus.ca/textbooks/an-introduction-to-philosophy-24/",
    "subjects": [
      "Humanities"
    ],
    "title": "An Introduction to Philosophy",
    "author": "W. Russ Payne",
    "description": "The goal of this text is to present philosophy to newcomers as a living discipline with historical roots. While a few early chapters are historically organized, the goal in the historical chapters is to trace a developmental progression of thought that introduces basic philosophical methods and frames issues that remain relevant today. Later chapters are topically organized. These include philosophy of science and philosophy of mind, areas where philosophy has shown dramatic recent progress. This text concludes with four chapters on ethics, broadly construed. Traditional theories of right action is covered in a third of these.Students are first invited first to think about what is good for themselves and their relationships in a chapter of love and happiness. Next a few meta-ethical issues are considered; namely, whether they are moral truths and if so what makes them so. The end of the ethics sequence addresses social justice, what it is for one’s community to be good. Our sphere of concern expands progressively through these chapters. Our inquiry recapitulates the course of development into moral maturity.Over the course of the text, the author has tried to outline the continuity of thought that leads from the historical roots of philosophy to a few of the diverse areas of inquiry that continue to make significant contributions to our understanding of ourselves and the world we live in."
  },
  {
    "url": "https://collection.bccampus.ca/textbooks/advanced-english-bccampus-20/",
    "subjects": [
      "Humanities"
    ],
    "title": "Advanced English",
    "author": "Allison Kilgannon",
    "description": "This text introduces students to reading and writing at the college level and was designed to fulfill the requirements for the Adult Basic Education (ABE) Advanced English Course. This text included examples, exercises, and definitions for many reading- and writing-related topics encountered in college courses."
  },
  {
    "url": "https://collection.bccampus.ca/textbooks/handbook-of-ehealth-evaluation/",
    "subjects": [
      "Health and Medical"
    ],
    "title": "Handbook of eHealth Evaluation",
    "author": "Francis Lau and Craig Kuziemksy",
    "description": "This handbook presents the science and practice of eHealth evaluation based on empirical evidence gathered over many years within the health informatics discipline. The handbook describes different approaches used to evaluate the planning, design, implementation, use and impact of eHealth systems in different health settings. It also provides a snapshot of the current state of knowledge on the consequences of opting for eHealth systems with respect to their effects and implications on provider performance and health outcomes."
  },
  {
    "url": "https://collection.bccampus.ca/textbooks/introduction-to-drafting-and-autocad-3d-bccampus-177/",
    "subjects": [
      "Engineering"
    ],
    "title": "Introduction to Drafting and AutoCAD 3D",
    "author": "Wally Baumback and Vancouver Community College",
    "description": "This book is a tool to guide and teach you to master AutoCAD 3D. No two students learn at the same pace, therefore the book was written with competency-based modules. The competency-based modules are bite-size pieces that allows you to work at your own pace. They can be used to learn by distance education, correspondence, online, instructor-lead classes, or by individuals teaching themselves to use AutoCAD in their own home or office."
  },
  {
    "url": "https://collection.bccampus.ca/textbooks/introduction-to-drafting-and-autocad-2d-bccampus-176/",
    "subjects": [
      "Engineering"
    ],
    "title": "Introduction to Drafting and AutoCAD 2D",
    "author": "Wally Baumback and Vancouver Community College",
    "description": "Introduction to Drafting and AutoCAD 2D was written as a tool to guide and teach you to master AutoCAD. No two students learn at the same pace, therefore the ebook was written with competency-based modules. The competency-based modules are bite-size pieces that allow you to work at your own pace. They can be used to learn by distance education, correspondence, online, instructor-lead classes, or by individuals teaching themselves to use AutoCAD in their own home or office."
  },
  {
    "url": "https://collection.bccampus.ca/textbooks/fundamentals-of-electrical-engineering-i-137/",
    "subjects": [
      "Engineering"
    ],
    "title": "Fundamentals of Electrical Engineering I",
    "author": "Don Johnson",
    "description": "The textbook focuses on the creation, manipulation, transmission, and reception of information by electronic means.Elementary signal theory; time- and frequency-domain analysis; Sampling Theorem.Digital information theory; digital transmission of analog signals; error-correcting codes."
  },
  {
    "url": "https://collection.bccampus.ca/textbooks/engineering-systems-dynamics-modelling-simulation-and-design-lagrangian-and-bond-graph-methods-british-columbia-institute-of-technology-111/",
    "subjects": [
      "Engineering"
    ],
    "title": "Engineering Systems, Dynamics, Modelling, Simulation, and Design",
    "author": "Mehrzad Tabatabaian",
    "description": "This open educational resource presents effective system modelling methods, including Lagrangian and bond graph, and the application of a relevant engineering software tool, 20-sim. The content is designed for engineering students and professionals in the field to support their understanding and application of these methods for modelling, simulation, and design of engineering systems.The text also includes videos showing selected worked-out examples."
  },
  {
    "url": "https://collection.bccampus.ca/textbooks/embedded-controllers-using-c-and-arduino-milne-open-textbooks-109/",
    "subjects": [
      "Engineering"
    ],
    "title": "Embedded Controllers using C and Arduino",
    "author": "James Fiore",
    "description": "This text introduces embedded controller systems using the inexpensive and widely available Arduino hardware platform and the C programming language. It is intended for students in Electrical Engineering and Electrical Engineering Technology programs at the Associate and Baccalaureate levels.Unlike many Arduino texts, this text does not rely solely on the Arduino libraries. Rather, it “gets under the hood” and directly accesses I/O ports, pins and DDR, as would be expected in a traditional college level microprocessor/microcontroller course.The companion laboratory manual introduces embedded controller systems using the Arduino hardware platform and the C programming language. Exercises include usage of seven-segment displays, switches and analog input devices; a reaction timer; PWM; an event counter and an arbitrary waveform generator."
  },
  {
    "url": "https://collection.bccampus.ca/textbooks/a-brief-introduction-to-engineering-computation-with-matlab/",
    "subjects": [
      "Engineering"
    ],
    "title": "A Brief Introduction to Engineering Computation with MATLAB",
    "author": "Serhat Beyenir",
    "description": "A Brief Introduction to Engineering Computation with MATLAB is specifically designed for students with no programming experience. However, students are expected to be proficient in first year mathematics and sciences and access to good reference books are highly recommended. Students are assumed to have a working knowledge of the Mac OS X or Microsoft Windows operating systems. The strategic goal of the course and book is to provide learners with an appreciation for the role computation plays in solving engineering problems. MATLAB specific skills that students are expected to be proficient in are:write scripts to solve engineering problems including interpolation,numerical integration and regression analysis,plot graphs to visualize, analyze and present numerical data, andpublish reports."
  },
  {
    "url": "https://collection.bccampus.ca/textbooks/first-aid-for-canada-127/",
    "subjects": [
      "Health and Medical"
    ],
    "title": "First Aid for Canada",
    "author": "Wikibooks",
    "description": "First aid is the provision of immediate care to a victim with an injury of illness, usually effected by a lay person, and performed within a limited skill range. First aid is normally performed until the injury or illness is satisfactorily dealt with (such as in the case of small cuts, minor bruises, and blisters) or until the next level of care, such as an ambulance or doctor, arrives.This book is a Canadian version of the original at Wikibooks. All references to protocols which do not comply with resuscitation standards in Canada have been removed."
  },
  {
    "url": "https://collection.bccampus.ca/textbooks/evidence-based-massage-therapy-a-guide-for-clinical-practice-ecampusontario-121/",
    "subjects": [
      "Health and Medical"
    ],
    "title": "Evidence-Based Massage Therapy",
    "author": "Richard Lebert",
    "description": "This clinical practice handbook will prove essential to massage therapists, physical therapists, chiropractors, medical doctors, psychologists and other health professionals who care for people with musculoskeletal pain. It is a living document and will be continuously updated as new research becomes available."
  },
  {
    "url": "https://collection.bccampus.ca/textbooks/creative-clinical-teaching-in-the-health-professions-athabasca-university-press-91/",
    "subjects": [
      "Health and Medical"
    ],
    "title": "Creative Clinical Teaching in the Health Professions",
    "author": "Sherri Melrose, Caroline Park, Beth Perry",
    "description": "This peer reviewed e-book is a must-read for nurses and other health professionals who strive to teach with creativity and excellence in clinical settings. Each chapter presents current evidence informed educational practice knowledge. Each topic is also presented with text boxes describing ‘Creative Strategies’ that clinical teachers from across Canada have successfully implemented. For those who are interested in background knowledge, the authors provided a comprehensive literature base. And, for those interested mainly in 'what to do,' the text box summaries offer step-by-step directions for creative, challenging activities that both new and experienced instructors can begin using immediately."
  },
  {
    "url": "https://collection.bccampus.ca/textbooks/clinical-procedures-for-safer-patient-care-thompson-rivers-university-edition/",
    "subjects": [
      "Health and Medical"
    ],
    "title": "Clinical Procedures for Safer Patient Care",
    "author": "Renée Anderson, Glynda Doyle, Jodie McCutcheon",
    "description": "This open educational resource (OER) was developed to ensure best practice and quality care based on the latest evidence, and to address inconsistencies in how clinical health care skills are taught and practised in the clinical setting. The checklist approach, used in this textbook, aims to provide standardized processes for clinical skills and to help nursing schools and clinical practice partners keep procedural practice current. Each skill/procedure is covered in a chapter that has learning outcomes, a brief overview of the relevant theory, checklists of steps for procedures with the rationale behind each step of the process, and a summary of key takeaways. All checklists, tables and videos are listed and hyperlinked in the appendices."
  },
  {
    "url": "https://collection.bccampus.ca/textbooks/clinical-procedures-for-safer-patient-care-bccampus-74/",
    "subjects": [
      "Health and Medical"
    ],
    "title": "Clinical Procedures for Safer Patient Care",
    "author": "Glynda Doyle and Jodie McCutcheon",
    "description": "This open educational resource (OER) was developed to ensure best practice and quality care based on the latest evidence, and to address inconsistencies in how clinical health care skills are taught and practised in the clinical setting. The checklist approach, used in this textbook, aims to provide standardized processes for clinical skills and to help nursing schools and clinical practice partners keep procedural practice current. Each skill/procedure is covered in a chapter that has learning objectives, a brief overview of the relevant theory, checklists of steps for procedures with the rationale behind each step of the process, and a summary of key takeaways. Key terms are set in bold throughout the book and laid out again in a Glossary in the appendix. All 88 checklists are also summarized, and hyperlinked to the original checklist, in the appendix."
  },
  {
    "url": "https://collection.bccampus.ca/textbooks/ethical-use-of-technology-in-digital-learning-environments-graduate-student-perspectives-university-of-calgary-118/",
    "subjects": [
      "Education"
    ],
    "title": "Ethical Use of Technology in Digital Learning Environments",
    "author": "Barbara Brown, Verena Roberts, Michele Jacobsen, Christie Hurrell",
    "description": "This book is the result of a co-design project in a class in the Masters of Education program at the University of Calgary. The course, and the resulting book, focus primarily on the safe and ethical use of technology in digital learning environments. The course was organized according to four topics based on Farrow’s (2016) Framework for the Ethics of Open Education. It discusses the following topics:Artificial Intelligence (AI)Social networking services (SNS)3D printingResource sharingAdaptive learning systemsSTEMAssistive technologiesAdmissionsCommunicationsIn each of the nine chapters, the authors discuss the connection to the value of technology in education, and practical possibilities of learning technologies for inclusive, participatory, democratic, and pluralistic educational paradigms."
  },
  {
    "url": "https://collection.bccampus.ca/textbooks/introduction-to-oceanography-roger-williams-university-181/",
    "subjects": [
      "Earth and Ocean Sciences"
    ],
    "title": "Introduction to Oceanography",
    "author": "Paul Webb",
    "description": "Introduction to Oceanography is a textbook appropriate to an introductory-level university course in oceanography. The book covers the fundamental geological, chemical, physical and biological processes in the ocean, with an emphasis on the North Atlantic region."
  },
  {
    "url": "https://collection.bccampus.ca/textbooks/forest-measurements-an-applied-approach-open-oregon-132/",
    "subjects": [
      "Earth and Ocean Sciences"
    ],
    "title": "Forest Measurements",
    "author": "Joan DeYoung",
    "description": "This is a Forest Measurements textbook written for field technicians. Silvicultural applications and illustrations are provided to demonstrate the relevance of the measurements. Special “technique tips” for each skill are intended to help increase data collection accuracy and confidence. These include how to avoid common pitfalls, effective short cuts, and essentials for recording field data correctly.The emphasis is on elementary skills; it is not intended to be a timber cruising guide."
  },
  {
    "url": "https://collection.bccampus.ca/textbooks/environmental-science-a-canadian-perspective-dalhousie-university-libraries-digital-editions-115/",
    "subjects": [
      "Earth and Ocean Sciences"
    ],
    "title": "Environmental Science",
    "author": "Bill Freedman",
    "description": "This textbook is intended to provide the core elements of a curriculum for teaching environmental science at the introductory level in Canadian colleges and universities. This book is suitable for students beginning a program in environmental science, environmental studies, or sustainability. It is also appropriate for arts students who require a science elective, and for science students who require a non-major elective. This book was written from the ground-up to provide Canadian information and examples. This national context is integrated throughout the text, along with North American and global data that provide a broader perspective."
  },
  {
    "url": "https://collection.bccampus.ca/textbooks/environmental-biology-open-oregon-114/",
    "subjects": [
      "Earth and Ocean Sciences"
    ],
    "title": "Environmental Biology",
    "author": "Matthew R. Fisher",
    "description": "Environmental Biology enables students to develop a nuanced understanding of today’s most pressing environmental issues. This text helps students grasp the scientific foundation of these issues so that they can better understand the world around them and their impact upon it. This open textbook covers the most salient environmental issues, from a biological perspective.The text is designed for an introductory-level college science course. Topics include the fundamentals of:ecologybiodiversitypollutionclimate changefood productionhuman population growth"
  },
  {
    "url": "https://collection.bccampus.ca/textbooks/digging-into-canadian-soils-an-introduction-to-soil-science-canadian-society-of-soil-science-100/",
    "subjects": [
      "Earth and Ocean Sciences"
    ],
    "title": "Digging into Canadian Soils",
    "author": "Canadian Society of Soil Science",
    "description": "Written entirely by members of the Canadian Society of Soil Science, Digging into Canadian Soils: An Introduction to Soil Science provides an introduction to the core disciplines of soil science, and introduces the concepts and vocabulary needed by students just beginning their soil science journey. The textbook provides supplementary materials that are specific to regions in Canada, or may be of specific interest beyond what might be considered introductory soil science material. Importantly, the textbook also is intended to introduce students to the Canadian System of Soil Classification by providing examples from across the length and breadth of the world’s second largest country, and to the Canadian Society of Soil Science, whose members share a common passion for soil science and are keen to share and instill this passion with students across Canada."
  },
  {
    "url": "https://collection.bccampus.ca/textbooks/british-columbia-in-a-global-context-bccampus-54/",
    "subjects": [
      "Earth and Ocean Sciences"
    ],
    "title": "British Columbia in a Global Context",
    "author": "Geography Open Textbook Collective",
    "description": "This first year geography textbook takes a holistic approach to geography by incorporating elements of physical, human and regional geography, as well as bringing in methods and perspectives from spatial information science. This textbook applies a fundamental geographical approach to understanding our globally changing world by looking at local processes which are linked to larger global processes and events. For example, mining and its effects are a global issue and we can see how these unfold in BC. A further example is the recent apology to First Nation peoples on the residential school treatment, as similar events occur in the US, Ireland and Australia. Processes of urbanization, a phenomenon which people all over the globe are experiencing, can be seen in Vancouver with our discussion of the city’s development. Geography students, indeed all first-year students, need to be able to critically assess their own contexts and environments in order to properly engage with our continually globalizing world."
  },
  {
    "url": "https://collection.bccampus.ca/textbooks/creating-online-learning-experiences-mavs-open-press-90/",
    "subjects": [
      "Education"
    ],
    "title": "Creating Online Learning Experiences",
    "author": "Matt Crosslin",
    "description": "This book provides an updated look at issues that comprise the online learning experience creation process. As online learning evolves, the lines and distinctions between various classifications of courses has blurred and often vanished. Classic elements of instructional design remain relevant at the same time that newer concepts of learning experience are growing in importance. However, problematic issues new and old still have to be addressed. This handbook explores many of these topics for new and experienced designers alike, whether creating traditional online courses, open learning experiences, or anything in between."
  },
  {
    "url": "https://collection.bccampus.ca/textbooks/complexites-capacites-communautes-changer-le-discours-sur-le-developpement-dans-leducation-la-protection-et-le-developpement-de-la-petite-enfance-university-of-victoria-84/",
    "subjects": [
      "Education"
    ],
    "title": "Complexités, Capacités, Communautés",
    "author": "Alan Pence and Allison Benner",
    "description": "Le terme “renforcement des capacités” est entré dans le langage courant durant le développement international du vingt-et-unième siècle. Alors que ce terme a une signification différente pour différentes personnes, il est souvent utilisé pour décrire une infusion de connaissances ou de compétences pour contribuer à la création d’un gouvernement ou institution capable de répondre aux défis majeurs liés au développement. Toutefois, comme d’autres interventions bien intentionnées de l’Ouest industrialisé, un tel “renforcement des capacités” peut avoir un effet autant destructeur que productif. Ce volume problématise de telles activités et présente une autre façon de promouvoir la construction de capacité dans le cadre du développement. Le volume commence par une exploration du concept de renforcement des capacités et se concentre ensuite sur deux exemples de promotion de capacités pour l’éducation, les soins et le développement de la petite enfance (DPE). Le Programme de Partenariats des Premières Nations (PPPN), un programme d’éducation postsecondaire innovateur et efficace lancé en 1989 à la demande d’un grand conseil tribal dans le nord du Canada, a mené à 10 apports éducatifs dans diverses communautés autochtones au cours des vingt ans qui ont suivis. Le deuxième programme, lancé en 1994 à la demande du siège de l’UNICEF, met l’accent sur l’Afrique subsaharienne. Alors que le programme inclut toute une gamme d’activités qui concernent la promotion de capacités, le vecteur central pour ce travail de développement est l’Université Virtuelle pour le Développement de la Petite-Enfance (UVDPE), un programme créé en 2001 et maintenant en phase de transition vers les universités africaines. Ce livre décrit des approches pour la promotion de capacité qui répondent aux complexités et aux possibilités des communautés – au niveau local ainsi que national. Ces initiatives défient le discours actuel en ce qui concerne le développent dans le cadre du DPE et du développement international et, ce faisant, fournit d’autres moyens de renforcer les capacités pour les chercheurs et les professionnels dans le DPE, l’éducation, et le vaste domaine du développement international."
  },
  {
    "url": "https://collection.bccampus.ca/textbooks/complexities-capacities-communities/",
    "subjects": [
      "Education"
    ],
    "title": "Complexities, Capacities, Communities",
    "author": "Alan Pence and Allison Benner",
    "description": "The term ‘capacity building’ has come into common usage in twenty-first century international development. While the term means different things to different people, it is often used to describe an infusion of knowledge or skills to help ‘build’ a government’s or institution’s ability to address key development challenges. However, like other well intentioned interventions from the industrialized West, such ‘capacity building’ can have destructive, as well as productive, impacts. This volume problematizes such activities and presents an alternative approach to promoting capacity in development contexts. The volume starts with an exploration of the concept of capacity building and goes on to focus on two examples of capacity promotion for early childhood education, care and development (ECD). The First Nations Partnerships Program (FNPP), an innovative and successful post-secondary education program initiated in 1989 at the request of a large tribal council in northern Canada, led to 10 educational deliveries with diverse Indigenous communities over the subsequent two decades. The second program, launched in 1994 at the request of UNICEF headquarters, focuses on sub-Saharan Africa. While the program encompasses a range of capacity-promoting activities, the central vehicle for this ECD development work is the Early Childhood Development Virtual University (ECDVU), a program created in 2001 and now in transition to African universities. This book describes approaches to capacity promotion that respond to the complexities and possibilities of communities—at local and country levels. These initiatives challenge established developmental narratives in ECD and international development, and in so doing provide alternative ways for scholars and practitioners in ECD, education, and the broad international development field to enhance capacities."
  },
  {
    "url": "https://collection.bccampus.ca/textbooks/a-comprehensive-guide-to-applying-universal-design-for-learning/",
    "subjects": [
      "Education"
    ],
    "title": "A Comprehensive Guide to Applying Universal Design for Learning",
    "author": "Seanna Takacs, Junsong Zhang, Helen Lee, Lynn Truong, David Smulders",
    "description": "For educators to improve their practice by integrating UDL principles in their work. The three workbooks include:Universal Design for Learning: A Practical Guide,Universal Design for Learning: Strategies for Blended and Online Learning, andAssessment Design: Perspectives and Examples Informed by Universal Design for Learning."
  },
  {
    "url": "https://collection.bccampus.ca/textbooks/iot-use-cases-and-technologies-british-columbia-institute-of-technology-202/",
    "subjects": [
      "Computer Science"
    ],
    "title": "IoT Use Cases and Technologies",
    "author": "F. John Dian and Reza Vahidnia",
    "description": "The phrase “Internet of Things\" (IoT) alludes to the billions of physical devices connected to the Internet in order to exchange raw data and analyze the information. This book introduces the IoT use cases and technologies. It uses practical examples to demonstrate the effect of IoT and its potential to change our world, and it discusses the existing wired and wireless communication technologies that have enabled IoT.The book also includes multiple choice and review questions to support student learning and reflection."
  },
  {
    "url": "https://collection.bccampus.ca/textbooks/introduction-to-professional-communications-bccampus-188/",
    "subjects": [
      "Communication & Writing"
    ],
    "title": "Introduction to Professional Communications",
    "author": "Melissa Ashman",
    "description": "No matter what your field is, having professional communication skills are essential to success in today's workplace. This book covers key business communications topics that will help you in your career, including intercultural communication, team work, professional writing, audience analysis and adapting messages, document formatting, oral communication, and more."
  },
  {
    "url": "https://collection.bccampus.ca/textbooks/communication-for-business-professionals-canadian-edition-ecampusontario-82/",
    "subjects": [
      "Communication & Writing"
    ],
    "title": "Communication for Business Professionals",
    "author": "Ontario Business Faculty and eCampusOntario Program Managers",
    "description": "This book provides a comprehensive, integrated approach to the study and application of written and oral business communication to serve both students and instructors. The text includes a number of features such as learning objectives, exercises, real-world examples, key terms, and post-chapter assessments.This open textbook is designed in 12 chapters featuring a spectrum of current and relevant Canadian business communication topics.This text is adapted from Business Communication for Success. This 2018 adaptation has significantly reduced the size and scope of the original publication and added Canadian examples."
  },
  {
    "url": "https://collection.bccampus.ca/textbooks/empoword-a-student-centered-anthology-and-handbook-for-college-writers-portland-state-university-library-110/",
    "subjects": [
      "Communication & Writing"
    ],
    "title": "EmpoWord",
    "author": "Shane Abrams",
    "description": "EmpoWord is a reader and rhetoric that champions the possibilities of student writing. The textbook uses actual student writing to exemplify effective writing strategies, celebrating dedicated college writing students to encourage and instruct their successors: the students in your class. Through both creative and traditional activities, readers are encouraged to explore a variety of rhetorical situations to become more critical agents of reading, writing, speaking, and listening in all facets of their lives. Straightforward and readable instruction sections introduce key vocabulary, concepts, and strategies. Three culminating assignments (Descriptive Personal Narrative; Text-Wrestling Analysis; Persuasive Research Essay) give students a chance to show their learning while also practicing rhetorical awareness techniques for future writing situations.This textbook is designed for students of first- and second-year college composition courses, but it is also a great tool for college prep students, more advanced writers, or independent learners."
  },
  {
    "url": "https://collection.bccampus.ca/textbooks/business-writing-for-everyone-kwantlen-polytechnic-university-59/",
    "subjects": [
      "Communication & Writing"
    ],
    "title": "Business Writing for Everyone",
    "author": "Arley Cruthers",
    "description": "Business Writing For Everyone is an inclusive guide to writing in the workplace. The book takes a process-oriented, storytelling approach to composition: focusing less on genre and more on the decisions that effective business communicators make. Business Writing For Everyone also contains interactive H5P activities for students to test their learning, and activities for further reflection that instructors can use in the classroom or assign as homework."
  },
  {
    "url": "https://collection.bccampus.ca/textbooks/building-blocks-of-academic-writing-bccampus-56/",
    "subjects": [
      "Communication & Writing"
    ],
    "title": "Building Blocks of Academic Writing",
    "author": "Carellin Brooks",
    "description": "Building Blocks of Academic Writing covers typical writing situations for developing academic writers, from prewriting and research through expressing themselves online. Developmental work in different types of paragraphs—descriptive, narrative, expository, persuasive—allows students to build capacity for longer essays. Each chapter includes review questions with a Canadian focus that instructors can assign to help students practise the skills developed in the text. This book aligns with the BC ABE Level: Intermediate English."
  },
  {
    "url": "https://collection.bccampus.ca/textbooks/introduction-to-web-accessibility-the-chang-school-toronto-metropolitan-university-194/",
    "subjects": [
      "Computer Science"
    ],
    "title": "Introduction to Web Accessibility",
    "author": "Digital Education Strategies and The Chang School",
    "description": "With raised awareness and accessibility laws emerging around the world, understanding what inclusive access to the Web means is becoming necessary knowledge for anyone who produces digital content. Much of the current information on Web accessibility requires some technical understanding, and may be difficult to consume for the average person. This book will “interpret” the W3C Web Content Accessibility Guidelines (WCAG 2.1), to make it easier to understand for a general audience. You will have an opportunity to experience barriers firsthand, then experience that content with the barriers removed, developing a practical understanding of web accessibility."
  },
  {
    "url": "https://collection.bccampus.ca/textbooks/delftse-foundations-of-computation-tu-delft-97/",
    "subjects": [
      "Computer Science"
    ],
    "title": "Delftse Foundations of Computation",
    "author": "Stefan Hugtenburg and Neil Yorke-Smith",
    "description": "Delftse Foundations of Computation is a textbook for an introductory course in theoretical computer science. It includes topics from propositional and predicate logic, proof techniques, set theory and the theory of computation, along with practical applications to computer science.It has no prerequisites other than a general familiarity with computer programming."
  },
  {
    "url": "https://collection.bccampus.ca/textbooks/database-design-2nd-edition-bccampus-96/",
    "subjects": [
      "Computer Science"
    ],
    "title": "Database Design",
    "author": "Adrienne Watt and Nelson Eng",
    "description": "Database Design - 2nd Edition covers database systems and database design concepts. New to this edition are SQL info, additional examples, key terms, and review exercises at the end of each chapter."
  },
  {
    "url": "https://collection.bccampus.ca/textbooks/cellular-internet-of-things-for-practitioners/",
    "subjects": [
      "Computer Science"
    ],
    "title": "Cellular Internet of Things for Practitioners",
    "author": "Reza Vahidnia and F. John Dian",
    "description": "This book describes the simplified architecture of an IoT network from the core functional perspective and then presents step-by-step procedures to establish a connection between the IoT device and platform. It practically shows how to connect a cellular IoT module to the Microsoft Azure IoT Hub using the LTE-M technology."
  },
  {
    "url": "https://collection.bccampus.ca/textbooks/algorithms-and-data-structures-with-applications-to-graphics-and-geometry-global-text-project-22/",
    "subjects": [
      "Computer Science"
    ],
    "title": "Algorithms and Data Structures with Applications to Graphics and Geometry",
    "author": "Jurg Nievergelt and Klaus Hinrichs",
    "description": "This is a textbook for first year computer science. It covers:programming environments for motion, graphics, and geometryprogramming concepts (beyond notation)objectsalgorithmsprogramscomplexity of problems and algorithmsdata structuresthe interaction between algorithms and data structures (case studies in geometric computation)"
  },
  {
    "url": "https://collection.bccampus.ca/textbooks/digital-accessibility-as-a-business-practice-the-chang-school-toronto-metropolitan-university-formerly-ryerson-university-101/",
    "subjects": [
      "Business Success"
    ],
    "title": "Digital Accessibility as a Business Practice",
    "author": "Digital Education Strategies and The Chang School",
    "description": "Most business leaders would agree that reaching the broadest audience is good for a business’s bottom line. A good portion of that audience will be people with disabilities. How, though, would an organization go about ensuring it is as accessible as it can be to all its potential clients or customers, including people with disabilities? This book has been created to answer this question, and to demystify “digital accessibility” as a business practice. It brings together all the pieces of the digital accessibility picture, and provides strategies and resources that will help make digital accessibility a part of an organization’s business culture."
  },
  {
    "url": "https://collection.bccampus.ca/textbooks/calculus-based-physics-ii/",
    "subjects": [
      "Political Science"
    ],
    "title": "Calculus-Based Physics II",
    "author": "Jeffrey W. Schnick",
    "description": "Calculus-Based Physics is an introductory physics textbook designed for use in the two-semester introductory physics course typically taken by science and engineering students. This is the second of two textbooks for this course."
  },
  {
    "url": "https://collection.bccampus.ca/textbooks/calculus-based-physics-i/",
    "subjects": [
      "Political Science"
    ],
    "title": "Calculus-Based Physics I",
    "author": "Jeffrey W. Schnick",
    "description": "Calculus-Based Physics is an introductory physics textbook designed for use in the two-semester introductory physics course typically taken by science and engineering students. This is the first of two textbooks for this course."
  },
  {
    "url": "https://collection.bccampus.ca/textbooks/biology-2e-openstax-49/",
    "subjects": [
      "Political Science"
    ],
    "title": "Biology",
    "author": "Mary Ann Clark, Jung Choi, Matthew Douglas",
    "description": "Biology - 2e is designed to cover the scope and sequence requirements of a typical two-semester biology course for science majors. The text provides comprehensive coverage of foundational research and core biology concepts through an evolutionary lens. Biology includes rich features that engage students in scientific inquiry, highlight careers in the biological sciences, and offer everyday applications. The book also includes various types of practice and homework questions that help students understand—and apply—key concepts.The second edition has been revised to incorporate clearer, more current, and more dynamic explanations, while maintaining the same organization as the first edition. Art and illustrations have been substantially improved, and the textbook features additional assessments and related resources."
  },
  {
    "url": "https://collection.bccampus.ca/textbooks/astronomy-openstax-29/",
    "subjects": [
      "Political Science"
    ],
    "title": "Astronomy",
    "author": "A. Fraknoi, David Morrison, Sidney Wolff",
    "description": "Astronomy is written in clear non-technical language, with the occasional touch of humor and a wide range of clarifying illustrations. It has many analogies drawn from everyday life to help non-science majors appreciate, on their own terms, what our modern exploration of the universe is revealing. Astronomy was written, updated, and reviewed by a broad range of astronomers and astronomy educators in a strong community effort.Astronomy has information and images from the New Horizons exploration of Pluto, the discovery of gravitational waves, the Rosetta Mission to Comet C-G, and many other recent projects in astronomy.The discussion of exoplanets has been updated with recent information—indicating not just individual examples, but trends in what sorts of planets seem to be most common. Black holes receive their own chapter, and the role of supermassive black holes in active galaxies and galaxy evolution is clearly explained. It is designed to meet scope and sequence requirements of introductory astronomy courses nationwide. Because there are many different ways to teach introductory astronomy, we have made the text as flexible as we could.Math examples are shown in separate sections throughout, so that you can leave out the math or require it as you deem best. Each section of a chapter treats a different aspect of the topic being covered; a number of sections could be omitted in shorter overview courses and can be included where you need more depth.This book is written to help students understand the big picture rather than get lost in random factoids to memorize. The language is accessible and inviting. Helpful diagrams and summary tables review and encapsulate the ideas being covered. Each chapter contains interactive group activities you can assign to help students work in teams and pool their knowledge."
  },
  {
    "url": "https://collection.bccampus.ca/textbooks/anatomy-and-physiology-openstax-27/",
    "subjects": [
      "Political Science"
    ],
    "title": "Anatomy and Physiology",
    "author": "J. Gordon Betts, Peter DeSaix, Eddie Johnson, Jody E. Johnson, Oksana Korol, Dean H. Kruse, Brandon Poe, James A. Wise",
    "description": "Anatomy and Physiology is a dynamic textbook for the two-semester human anatomy and physiology course for life science and allied health majors. The book is organized by body system and covers standard scope and sequence requirements. Its lucid text, strategically constructed art, career features, and links to external learning tools address the critical teaching and learning challenges in the course. The web-based version of Anatomy and Physiology also features links to surgical videos, histology, and interactive diagrams."
  },
  {
    "url": "https://collection.bccampus.ca/textbooks/analytical-chemistry-20-uc-davis-25/",
    "subjects": [
      "Political Science"
    ],
    "title": "Analytical Chemistry 2.0",
    "author": "David Harvey",
    "description": "Analytical Chemistry is more than a collection of analytical methods and an understanding of equilibrium chemistry; it is an approach to solving chemical problems. Although equilibrium chemistry and analytical methods are important, their coverage should not come at the expense of other equally important topics.The introductory course in analytical chemistry is the ideal place in the undergraduate chemistry curriculum for exploring topics such as:experimental designsamplingcalibration strategiesstandardizationoptimizationstatisticsthe validation of experimental resultsAnalytical methods come and go, but best practices for designing and validating analytical methods are universal. Because chemistry is an experimental science it is essential that all chemistry students understand the importance of making good measurements."
  },
  {
    "url": "https://collection.bccampus.ca/textbooks/business-math-a-step-by-step-handbook-2018a-lyryx-58/",
    "subjects": [
      "Business Success"
    ],
    "title": "Business Math",
    "author": "Jean-Paul Olivier",
    "description": "Business Math is the study of mathematics required by the field of business. Business professionals will work with taxes, gross earnings, product prices, and currency exchange; they will be offered loans, lines of credit, mortgages, leases, savings bonds, and other financial tools. This textbook covers all of these topics and how these financial tools can maximize their earnings and minimize their costs. It also discusses how to execute smart monetary decisions both personally and for their business."
  },
  {
    "url": "https://collection.bccampus.ca/textbooks/business-ethics-openstax-57/",
    "subjects": [
      "Business Success"
    ],
    "title": "Business Ethics",
    "author": "Stephen M. Byars and Kurt Stanberry",
    "description": "Business Ethics is designed to meet the scope and sequence requirements of the single-semester business ethics course. This title includes innovative features designed to enhance student learning, including case studies, application scenarios, and links to video interviews with executives, all of which help instill in students a sense of ethical awareness and responsibility."
  },
  {
    "url": "https://collection.bccampus.ca/textbooks/building-a-competitive-first-nation-investment-climate-tulo-centre-55/",
    "subjects": [
      "Business Success"
    ],
    "title": "Building a Competitive First Nation Investment Climate",
    "author": "Tulo Centre of Indigenous Economics",
    "description": "This is the first edition of the open text book Building a Competitive Investment Climate on First Nation Lands. This textbook is for students who are First Nation and tribal government employees or students who would like to work for or with First Nation and tribal governments. The purpose of this textbook is to help interested First Nation and tribal governments build a competitive investment climate. Work began on this text book in early 2012 with a generous grant from the Donner Canadian Foundation. Financial support was also provided by the First Nations Tax Commission and the Tulo Centre."
  },
  {
    "url": "https://collection.bccampus.ca/textbooks/beginning-excel-2019/",
    "subjects": [
      "Business Success"
    ],
    "title": "Beginning Excel 2019",
    "author": "Noreen Brown, Barbara Lave, Julie Romey, Mary Schatz, Art Schneider, Diane Shingledecker",
    "description": "This Beginning Excel textbook is intended for use in a one-term introductory spreadsheet course for all majors. The basics of Excel, as they apply to the professional workplace, are introduced, including spreadsheet design, data entry, formulas, functions, charts, tables, and multi-sheet use. This textbook includes instructions for Excel for Mac also."
  },
  {
    "url": "https://collection.bccampus.ca/textbooks/exploring-movie-construction-and-production-open-suny-textbooks-122/",
    "subjects": [
      "Graphic Design"
    ],
    "title": "Exploring Movie Construction and Production",
    "author": "John Reich",
    "description": "Exploring Movie Construction and Production contains eight chapters of the major areas of film construction and production. The discussion coversthemegenrenarrative structurecharacter portrayalstory, plotdirecting stylecinematographyeditingImportant terminology is defined and types of analysis are discussed and demonstrated. An extended example of how a movie description reflects the setting, narrative structure, or directing style is used throughout the book to illustrate building blocks of each theme. This approach to film instruction and analysis has proved beneficial to increasing students’ learning, while enhancing the creativity and critical thinking of the student."
  },
  {
    "url": "https://collection.bccampus.ca/textbooks/sight-reading-for-guitar/",
    "subjects": [
      "Graphic Design"
    ],
    "title": "Sight-Reading for Guitar",
    "author": "Chelsea Green",
    "description": "This book teaches guitar players from all musical backgrounds to understand, read and play modern staff notation in real time. The Keep Going Method is designed to impart the knowledge, skills and attitudes needed for sight-reading with efficiency, fun and encouragement."
  },
  {
    "url": "https://collection.bccampus.ca/textbooks/graphic-design-and-print-production-fundamentals-bccampus-143/",
    "subjects": [
      "Graphic Design"
    ],
    "title": "Graphic Design and Print Production Fundamentals",
    "author": "Graphic Communications Open Textbook Collective",
    "description": "This textbook — written by a group of select experts with a focus on different aspects of the design process, from creation to production — addresses the many steps of creating and then producing physical, printed, or other imaged products that people interact with on a daily basis. It covers the concept that, while most modern graphic design is created on computers using design software, the ideas and concepts don’t stay on the computer. The ideas need to be completed in the computer software, then progress to an imaging (traditionally referred to as printing) process. Keywords are highlighted throughout and summarized in a Glossary at the end of the book, and each chapter includes exercises and suggested readings."
  }
]